Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.SelectRebarItem Method
Overload List
Name | Description
SelectRebarItem(String, String)
 Selects a rebar item in the rebar database with the given grade and size.
SelectRebarItem(String, Double, Boolean)
 Selects a rebar item in the rebar database with the given grade and nominal diameter.
SelectRebarItem(String, String, Double)
 Selects a rebar item in the rebar database with the given grade, size and bending radius.
SelectRebarItem(String, String, String)
 Selects a rebar item in the rebar database with the given grade, size and usage.
SelectRebarItem(String, Double, Double, Boolean)
 Selects a rebar item in the rebar database with the given grade, nominal diameter and bending radius.
SelectRebarItem(String, Double, String, Boolean)
 Selects a rebar item in the rebar database with the given grade, nominal diameter and bending radius.
SelectRebarItem(String, String, String, String)
 Selects a rebar item in the rebar database with the given grade, size, usage and code.
Top
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace